var ft = new Vue({
    el: '#app',
    data: {
        numP: 3,
        showTags: false,
        showHint: false,
        message: 'Сгенерируйте нужное количество абзацев=)',
        theme: 0,
        textContent: [
            ["",
            "Сегодня люди не представляют свою жизнь без современных технологий, в частности, без компьютера.",
            "Компьютер стал неотъемлемой частью жизни человека. Это обязательный инструмент развития человека. Каждая большая и малая промышленность компьютеризирована. Компьютеры выполнять свою работу эффективно, быстро и продуктивно. Без сомнений, они сделали нашу жизнь намного легче.",
            "Но проблема в том, что вместе с положительным эффектом, компьютеры оказывают негативное влияние на человека.",
            "Многие люди, работа которых связана с компьютерами жалуются на проблемы со здоровьем, такие как головная боль, заболевания кисти, боли в спине, плохое зрение. Кроме того, проводя много времени за компьютером, начинаем чрезмерно питаться, что в свою очередь приводит к ожирению.",
            "Маленькие дети больше всего подвержены риску. Сейчас они часто остаются без присмотра. Поэтому они много времени проводят за монитором компьютера, играют в компьютерные игры, смотрят видео или просто сидят в Интернете. В результате дети не развиваются физически. Они не проводят время на свежем воздухе, не занимаются спортом и не играют в игры. Позже им становится трудно общаться с другими людьми в живую, потому что они не имеют необходимых коммуникативных и социальных навыков.",
            "Итак, мы можем подвести итог, что современные технологии, и компьютеры в частности, имеют как положительные, так и отрицательные последствия для жизни людей. А для того, чтобы жить в гармонии люди должны найти правильный баланс. Они должны помнить, что компьютер изначально был создан, чтобы помочь людям, сделать их жизнь легче, а не разрушить ее.",
            "Компьютерные технологии стали неотъемлемой частью жизни людей. Эти технологии имеют свои корни. Возьмём, например, слово «мышка». Компьютерная мышь совсем не то же самое, что маленький грызун, который живёт в зданиях и полях. Это небольшой прибор, который вы двигаете туда-сюда по плоской поверхности, сидя за компьютером. Мышь перемещает стрелку (или курсор) на экране компьютера. Идея такого устройства пришла в голову специалисту по компьютерам Дугласу Энгельбарту в начале 60-х годов XX века. Первая компьютерная мышь представляла собой резной деревянный кубик с двумя металлическими колёсиками. Прибор назвали мышью, так как с одного конца у него был хвостик. Хвостом был провод, который присоединял устройство к компьютеру.",
            "Использование компьютера требует специальных навыков. Людей, достигших в этом мастерства, иногда называют «хакерами». Обычно хакер – это человек, который создаёт программное обеспечение на специальном компьютерном языке. Но слово «хакер» также применимо к человеку, который пытается украсть информацию из компьютерных систем.",
            "Компьютеры коренным образом изменили жизнь каждого человека. Несколько десятилетий назад люди даже не знали ничего об этих электронных устройствах, тогда как в наши дни даже маленький ребенок может управлять этой машиной. Почти все современные технологии зависит от компьютеров, которые используются для хранения данных: файлов, секретной информации, банковских операций и прочего.",
            "Интересно, что первый компьютер был размером с микроавтобус и весил почти тонну. В то время как сейчас это может быть маленький чип размером с булавку. И компьютерные технологии не стоят на месте, она быстро прогрессируют."
            ],
            [   "",
                "Россия была провозглашена республикой 1 сентября 1917 года, хотя фактически стала ею 3 марта 1917 года в результате Февральской революции. С 10 января 1918 года — РСФСР. 30 декабря 1922 года РСФСР вместе с другими советскими республиками учредила СССР, неофициально его тоже часто называли «Россией».",
                "До V века славяне жили при родовом строе. Во главе каждой родовой общины стоял родовой старейшина, обладающий неограниченной властью. Земля являлась собственностью общины, часть сельскохозяйственных работ осуществлялась коллективно. C V века началось разложение родового строя, родовая община начала заменяться территориальной общиной (вервью), управление общиной наряду со старейшинами стало осуществлять вече — общее собрание членов общины.",
                "Расширение государства на юг привело к столкновению с могущественной Хазарией, центр которой располагался на нижней Волге. Князь Святослав нанёс хазарам сокрушительный удар в 965 году. Его мать княгиня Ольга в частном порядке приняла христианство, а её внук Владимир окончательно закрепил христианство на Руси в 988 году.",
                "После падения Хазарии в степях господствовали, сменяя друг друга, тюркоязычные народы: печенеги, огузы и половцы. Их племена не обладали политическим единством.",
                "Если смоленские и черниговские князья стремились занять киевское княжение лично, то владимиро-суздальские (с 1157) и галицкие — через младших родственников или союзников. Во Владимиро-Суздальском княжестве после войны за наследство Андрея Боголюбского утвердилась сильная княжеская власть, опиравшееся на новый служилый слой, прообраз дворянства. Главной особенностью Новгородской земли был республиканский строй, при котором вече во главе с боярством назначало посадников, приглашало и изгоняло князей.",
                "Почти сразу после этого на юге возникла Галицкая митрополия, а затем Литовская, существовавшие впоследствии с перерывами. Киевский митрополит в 1325 году вторично поменял резиденцию, переехав в Москву. Впоследствии великие княжества Московское и Литовское стремились к тому, чтобы именно их претендент занимал общерусскую митрополию или как минимум был свой митрополит в те периоды, когда общерусская митрополия контролировалась «чужим» претендентом.",
                "Оседлое население Орды включало волжских булгар, мордовские народы, славян, греков и др. Среди кочевых народов были половцы, канглыи, татары, туркмены, киргизы и другие.",
                "В 1547 году великий князь московский Иван IV Грозный венчался на царство и стал, таким образом, первым российским царём. В 1549 году был созван первый сословно-представительный орган — Земский собор. Было создано вооружённое огнестрельным оружием стрелецкое войско. Уложение о службе 1555—1556 годов обязало всех землевладельцев выставлять воинов пропорционально площади земли.",
                "Объединение Польши и Литвы в одно государство сделало возможным их совместные контрнаступательные действия. России с трудом удалось отстоять Псков (1582). Ливонская война, в ходе которой впервые русская армия держалась под знамёнами подряд много лет, вместе с опричниной ударила по экономике и привела к потере Россией выхода к Балтийскому морю.",
                "В 1654 году казаки Богдана Хмельницкого, поднявшие восстание против Польши, присягнули на верность московскому царю Алексею. Этот акт привёл к русско-польской войне, в результате которой Киев, Смоленск и значительная часть Приднепровья попадает под власть Москвы"
            ]

        ]
    },
    created: function () {
        this.generateContent();
    },
    methods: {
        generateContent: function () {
            this.message = ''; // очистка поля
            for(var i = 0; i < this.numP; i++) {
                var textNumber = Math['floor'](Math['random']() * (10 - 1 + 1)) + 1;
                this.message += (this.showTags ? '<p>':'') + this.textContent[this.theme][textNumber] + (this.showTags ? '</p>':'') + '\n\n';
            }
        },
        doCopy: function () {
            var $this = this;
            this.$copyText(this.message).then(function () {
                $this.showHint = true;
                setTimeout(function () {$this.showHint = false}, 1000);
            }, function () {
                alert('Can not copy');
            })
        },
        setTags: function () {
            var $this = this;
            if($this.showTags == true) {
                $this.message = 'bro'
            }
        }
    }
});